case_study/pollutant_kepsilon/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
	value		uniform 0;
    }

    outlet
    {
       type            zeroGradient;
    }

    ground
    {
        type            zeroGradient;
    }
 building
    {
        type            zeroGradient;
    }
    
   
    frontAndBack
    {
        type            symmetry;
    }


    
}

// ************************************************************************* //
