case_study/pollutant_kepsilon/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
     {
        name    selectedCellsCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
        
        box     (-57 15 0) (-50 32 10) ;
        }
    }

     {
        name    selectedCellsCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        sourceInfo
        {
        //box     (-57 47.75 0)(-50 64.75 10);
        box     (-57 47.75 0) (-50 64.75 10);
        }
    }

     {
        name    selectedCellsCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        sourceInfo
        {
        box (-57 -32 0)(-50 -15 10)  ;
        }
    }


    {
        name    selectedCellsCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        sourceInfo
        {
        box (-57 -64.75 0)(-50 -47.75 10) ;
        }
    }
    {
        name    selectedCells;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     selectedCellsCellSet;
    }

   

);

// ************************************************************************* //
